Autodesk.Revit.DB.Geolocation.Services.GeolocationData.GetUnits
Returns:
the conversion options.

Autodesk.Revit.DB.Geolocation.Services.GeolocationData.SetGeolocation(Autodesk.Revit.DB.Geolocation.GeolocationBase)
Stores the Geolocation.
geolocation:
The Geolocation created by the server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.Services.GeolocationData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Geolocation.Services.GeolocationData
Abstract class used by the ICreateGeolocationServer
and the ILoadGeolocationServer
to process CreateGeolocationService and
to process LoadGeolocationService requests.
The base class provides the storage for the returned Geolocation the desired units as input,
subclasses add in the necessary input fields required for their specific purpose.